{
  "title": "João Emanuel",
  "subtitle": "Software Engineer | InfoSec | DevOps | Cybersecurity",
  "aboutTitle": "About Me",
  "aboutText": "Software Engineer specialized in InfoSec, DevOps, and Cybersecurity. Development focused on high performance, security, and scalable architectures, applying Clean Code, Clean Architecture, SOLID, and DDD. Expertise in Cloudflare, Docker, and CI/CD. Primary stacks: PHP, NestJS, Python, React, and Java.",
  "technologiesTitle": "Technologies & Tools",
  "navbar": {
    "presentation": "About",
    "projects": "Projects",
    "company": "Company",
    "contact": "Contact"
  },
  "presentation": {
    "title": "About Me",
    "intro": "Software Engineer specialized in InfoSec, DevOps, and Cybersecurity, with strong expertise in developing robust and scalable solutions.",
    "experience": "Development focused on high performance, top-tier security, and scalable architectures, rigorously applying Clean Code, Clean Architecture, SOLID, and Domain-Driven Design (DDD) principles. Technical expertise in cloud infrastructure (Cloudflare), containerization (Docker), CI/CD automation, and multi-language development.",
    "passion": "Mastery of primary stacks: PHP, NestJS, Python, React, and Java. Proven interpersonal skills in technical leadership, strategic project management, and efficient translation of business rules into high-impact technological solutions."
  },
  "skills": {
    "architecture": "Architecture",
    "security": "Security",
    "devops": "DevOps",
    "development": "Development",
    "cloud": "Cloud",
    "leadership": "Leadership"
  },
  "projects": {
    "title": "My Projects",
    "project1": {
      "title": "Secure Cloud Infrastructure",
      "description": "Scalable infrastructure architecture using Cloudflare, Docker, and CI/CD with focus on high availability and advanced security."
    },
    "project2": {
      "title": "Security Monitoring System",
      "description": "Real-time monitoring platform with vulnerability analysis, threat detection, and automated incident response."
    },
    "project3": {
      "title": "Clean Architecture with DDD",
      "description": "Implementation of enterprise systems applying Clean Architecture, SOLID, and Domain-Driven Design for maximum maintainability and scalability."
    }
  },
  "company": {
    "title": "Professional Experience",
    "technologies": "Technologies & Tools",
    "builders": "Software Engineer specialized in security, DevOps, and scalable architectures. Development of critical solutions with focus on performance and data protection.",
    "extds": "Technical leadership and international project management, coordinating teams and implementing high-impact solutions with focus on quality and security."
  },
  "contact": {
    "title": "Let's Connect!",
    "linkedin": "Connect with me on LinkedIn",
    "email": "Send me an email",
    "github": "Check out my code on GitHub"
  }
}
