{
  "title": "João Emanuel",
  "subtitle": "Software Engineer | InfoSec | DevOps | Cybersecurity",
  "aboutTitle": "About Me",
  "aboutText": "Software Engineer with experience across web and mobile platforms, focused on scalable APIs, security, and high performance. End-to-end delivery: architecture, development, testing, and DevOps, applying Clean Architecture, SOLID, and DDD. Recent experience at Platform Builders, UNICRED, Zallpy, and Facta Financeira.",
  "technologiesTitle": "Technologies & Tools",
  "navbar": {
    "projects": "Projects",
    "company": "Experience",
    "contact": "Contact"
  },
  "skills": {
    "architecture": "Architecture",
    "security": "Security",
    "devops": "DevOps",
    "development": "Development",
    "cloud": "Cloud",
    "leadership": "Leadership"
  },
  "projects": {
    "title": "My Projects",
    "project1": {
      "title": "Web/Mobile CRM Platform — UNICRED",
      "description": "Architecture and development of secure and scalable RESTful APIs with PHP/Hyperf and NestJS, messaging with Kafka, and CI/CD automation. Focus on performance, security, and quality."
    },
    "project2": {
      "title": "Systems Modernization — Facta Financeira",
      "description": "Refactoring of critical systems (Structure, Portals, CRM, Insurance, Cards), strengthening security and scalability, Dock boletos/cards APIs, and process automation with bots."
    },
    "project3": {
      "title": "Microservices Ecosystem — Zallpy",
      "description": "Building and maintaining web/mobile applications and backend services with PHP, NestJS, and Python; Docker, Kafka, and SQL Server; focus on performance, testing, and observability."
    }
  },
  "company": {
    "title": "Professional Experience",
    "technologies": "Technologies & Tools",
    "builders": "Software Engineer specialized in security, DevOps, and scalable architectures. Development of critical solutions with focus on performance and data protection.",
    "extds": "Technical leadership and international project management, coordinating teams and implementing high-impact solutions with focus on quality and security."
  },
  "contact": {
    "title": "Let's Connect!",
    "subtitle": "Let's work together! Get in touch through any of these channels.",
    "linkedin": "Connect with me on LinkedIn",
    "email": "Send me an email",
    "github": "Check out my code on GitHub"
  }
}
