{
  "title": "João Emanuel",
  "subtitle": "Engenheiro de Software | InfoSec | DevOps | Cibersegurança",
  "aboutTitle": "Sobre Mim",
  "aboutText": "Engenheiro de Software especializado em InfoSec, DevOps e Cibersegurança. Desenvolvimento focado em alta performance, segurança e arquiteturas escaláveis, aplicando Clean Code, Clean Architecture, SOLID e DDD. Expertise em Cloudflare, Docker e CI/CD. Stacks principais: PHP, NestJS, Python, React e Java.",
  "technologiesTitle": "Tecnologias & Ferramentas",
  "navbar": {
    "presentation": "Sobre",
    "projects": "Projetos",
    "company": "Empresa",
    "contact": "Contato"
  },
  "presentation": {
    "title": "Sobre Mim",
    "intro": "Engenheiro de Software especializado em InfoSec, DevOps e Cibersegurança, com forte atuação no desenvolvimento de soluções robustas e escaláveis.",
    "experience": "Desenvolvimento focado em alta performance, segurança de ponta e arquiteturas escaláveis, aplicando rigorosamente os princípios de Clean Code, Clean Architecture, SOLID e Domain-Driven Design (DDD). Expertise técnica em infraestrutura cloud (Cloudflare), containerização (Docker), automação de CI/CD e desenvolvimento em múltiplas linguagens.",
    "passion": "Domínio das stacks principais: PHP, NestJS, Python, React e Java. Habilidades interpessoais comprovadas em liderança técnica, gestão estratégica de projetos e tradução eficiente de regras de negócio em soluções tecnológicas de alto impacto."
  },
  "skills": {
    "architecture": "Arquitetura",
    "security": "Segurança",
    "devops": "DevOps",
    "development": "Desenvolvimento",
    "cloud": "Cloud",
    "leadership": "Liderança"
  },
  "projects": {
    "title": "Meus Projetos",
    "project1": {
      "title": "Infraestrutura Cloud Segura",
      "description": "Arquitetura de infraestrutura escalável utilizando Cloudflare, Docker e CI/CD com foco em alta disponibilidade e segurança avançada."
    },
    "project2": {
      "title": "Sistema de Monitoramento de Segurança",
      "description": "Plataforma de monitoramento em tempo real com análise de vulnerabilidades, detecção de ameaças e automação de resposta a incidentes."
    },
    "project3": {
      "title": "Arquitetura Clean com DDD",
      "description": "Implementação de sistemas corporativos aplicando Clean Architecture, SOLID e Domain-Driven Design para máxima manutenibilidade e escalabilidade."
    }
  },
  "company": {
    "title": "Experiência Profissional",
    "technologies": "Tecnologias & Ferramentas",
    "builders": "Engenheiro de Software especializado em segurança, DevOps e arquiteturas escaláveis. Desenvolvimento de soluções críticas com foco em performance e proteção de dados.",
    "extds": "Liderança técnica e gestão de projetos internacionais, coordenando equipes e implementando soluções de alto impacto com foco em qualidade e segurança."
  },
  "contact": {
    "title": "Vamos Conversar!",
    "linkedin": "Conecte-se comigo no LinkedIn",
    "email": "Envie-me um email",
    "github": "Confira meu código no GitHub"
  }
}
