{
  "title": "João Emanuel",
  "subtitle": "Engenheiro de Software | InfoSec | DevOps | Cibersegurança",
  "aboutTitle": "Sobre Mim",
  "aboutText": "Engenheiro de Software com experiência em plataformas web e mobile, focado em APIs escaláveis, segurança e alta performance. Atuação ponta a ponta: arquitetura, desenvolvimento, testes e DevOps, aplicando Clean Architecture, SOLID e DDD. Experiência recente em empresas como Platform Builders, UNICRED, Zallpy e Facta Financeira.",
  "technologiesTitle": "Tecnologias & Ferramentas",
  "navbar": {
    "projects": "Projetos",
    "company": "Experiências",
    "contact": "Contato"
  },
  "skills": {
    "architecture": "Arquitetura",
    "security": "Segurança",
    "devops": "DevOps",
    "development": "Desenvolvimento",
    "cloud": "Cloud",
    "leadership": "Liderança"
  },
  "projects": {
    "title": "Meus Projetos",
    "project1": {
      "title": "Plataforma de CRM Web/Mobile — UNICRED",
      "description": "Arquitetura e desenvolvimento de APIs RESTful seguras e escaláveis com PHP/Hyperf e NestJS, mensageria com Kafka e automação CI/CD. Foco em performance, segurança e qualidade."
    },
    "project2": {
      "title": "Modernização de Sistemas — Facta Financeira",
      "description": "Refatoração de sistemas críticos (Estrutura, Portais, CRM, Seguros, Cartões), fortalecimento de segurança e escalabilidade, APIs de boletos e cartões Dock e automação de processos com robôs."
    },
    "project3": {
      "title": "Ecossistema de Microserviços — Zallpy",
      "description": "Construção e manutenção de aplicações web/mobile e serviços backend com PHP, NestJS e Python; Docker, Kafka e SQL Server; foco em performance, testes e observabilidade."
    }
  },
  "company": {
    "title": "Experiências Profissionais",
    "technologies": "Tecnologias & Ferramentas",
    "builders": "Engenheiro de Software especializado em segurança, DevOps e arquiteturas escaláveis. Desenvolvimento de soluções críticas com foco em performance e proteção de dados.",
    "extds": "Liderança técnica e gestão de projetos internacionais, coordenando equipes e implementando soluções de alto impacto com foco em qualidade e segurança."
  },
  "contact": {
    "title": "Vamos Conversar!",
    "subtitle": "Vamos trabalhar juntos! Entre em contato através de qualquer um desses canais.",
    "linkedin": "Conecte-se comigo no LinkedIn",
    "email": "Envie-me um email",
    "github": "Confira meu código no GitHub"
  }
}
